{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.2.6", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "name": "input"}, "inbound_nodes": []}, {"name": "conv2d_10", "class_name": "Conv2D", "config": {"name": "conv2d_10", "trainable": true, "filters": 4, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input", 0, 0, {}]]]}, {"name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_9", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"name": "activation_9", "class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"name": "conv2d_11", "class_name": "Conv2D", "config": {"name": "conv2d_11", "trainable": true, "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"name": "batch_normalization_10", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_10", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"name": "activation_10", "class_name": "Activation", "config": {"name": "activation_10", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"name": "max_pooling2d_5", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_5", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"name": "conv2d_12", "class_name": "Conv2D", "config": {"name": "conv2d_12", "trainable": true, "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]]}, {"name": "batch_normalization_11", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_11", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"name": "activation_11", "class_name": "Activation", "config": {"name": "activation_11", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"name": "conv2d_13", "class_name": "Conv2D", "config": {"name": "conv2d_13", "trainable": true, "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"name": "batch_normalization_12", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_12", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"name": "add_3", "class_name": "Add", "config": {"name": "add_3", "trainable": true}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}], ["max_pooling2d_5", 0, 0, {}]]]}, {"name": "activation_12", "class_name": "Activation", "config": {"name": "activation_12", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"name": "max_pooling2d_6", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_6", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"name": "conv2d_14", "class_name": "Conv2D", "config": {"name": "conv2d_14", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]]}, {"name": "batch_normalization_13", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_13", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"name": "activation_13", "class_name": "Activation", "config": {"name": "activation_13", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"name": "max_pooling2d_7", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_7", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"name": "conv2d_15", "class_name": "Conv2D", "config": {"name": "conv2d_15", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_7", 0, 0, {}]]]}, {"name": "batch_normalization_14", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_14", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"name": "activation_14", "class_name": "Activation", "config": {"name": "activation_14", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"name": "conv2d_16", "class_name": "Conv2D", "config": {"name": "conv2d_16", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"name": "batch_normalization_15", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_15", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"name": "add_4", "class_name": "Add", "config": {"name": "add_4", "trainable": true}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}], ["max_pooling2d_7", 0, 0, {}]]]}, {"name": "activation_15", "class_name": "Activation", "config": {"name": "activation_15", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"name": "max_pooling2d_8", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_8", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_15", 0, 0, {}]]]}, {"name": "conv2d_17", "class_name": "Conv2D", "config": {"name": "conv2d_17", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_8", 0, 0, {}]]]}, {"name": "batch_normalization_16", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_16", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"name": "activation_16", "class_name": "Activation", "config": {"name": "activation_16", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"name": "conv2d_18", "class_name": "Conv2D", "config": {"name": "conv2d_18", "trainable": true, "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_16", 0, 0, {}]]]}], "input_layers": [["input", 0, 0]], "output_layers": [["conv2d_18", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "binary_crossentropy", "metrics": [], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization_10/gamma", "shape": [8], "dtype": "float32", "quantization": {"min": 0.8421292304992676, "scale": 0.00110017178105373, "dtype": "uint8"}}, {"name": "batch_normalization_10/beta", "shape": [8], "dtype": "float32", "quantization": {"min": -0.10908699316136977, "scale": 0.0006860817179960363, "dtype": "uint8"}}, {"name": "batch_normalization_10/moving_mean", "shape": [8], "dtype": "float32", "quantization": {"min": -0.8989035384327758, "scale": 0.0074289548630807915, "dtype": "uint8"}}, {"name": "batch_normalization_10/moving_variance", "shape": [8], "dtype": "float32", "quantization": {"min": 0.18701930344104767, "scale": 0.013328083999016705, "dtype": "uint8"}}, {"name": "batch_normalization_11/gamma", "shape": [8], "dtype": "float32", "quantization": {"min": 0.8897166848182678, "scale": 0.0014298128146751255, "dtype": "uint8"}}, {"name": "batch_normalization_11/beta", "shape": [8], "dtype": "float32", "quantization": {"min": -0.19099968321183147, "scale": 0.00254666244282442, "dtype": "uint8"}}, {"name": "batch_normalization_11/moving_mean", "shape": [8], "dtype": "float32", "quantization": {"min": -0.8909201897826851, "scale": 0.008649710580414418, "dtype": "uint8"}}, {"name": "batch_normalization_11/moving_variance", "shape": [8], "dtype": "float32", "quantization": {"min": 1.4746038913726807, "scale": 0.0048212752622716565, "dtype": "uint8"}}, {"name": "batch_normalization_12/gamma", "shape": [8], "dtype": "float32", "quantization": {"min": 0.8532525897026062, "scale": 0.0017377350844588935, "dtype": "uint8"}}, {"name": "batch_normalization_12/beta", "shape": [8], "dtype": "float32", "quantization": {"min": -0.4185335785734888, "scale": 0.003948429986542347, "dtype": "uint8"}}, {"name": "batch_normalization_12/moving_mean", "shape": [8], "dtype": "float32", "quantization": {"min": -1.7564297394425261, "scale": 0.007538325061985091, "dtype": "uint8"}}, {"name": "batch_normalization_12/moving_variance", "shape": [8], "dtype": "float32", "quantization": {"min": 1.4897305965423584, "scale": 0.007778000364116594, "dtype": "uint8"}}, {"name": "batch_normalization_13/gamma", "shape": [16], "dtype": "float32", "quantization": {"min": 0.7569006085395813, "scale": 0.001158597656324798, "dtype": "uint8"}}, {"name": "batch_normalization_13/beta", "shape": [16], "dtype": "float32", "quantization": {"min": -0.4892100890477499, "scale": 0.0028777064061632344, "dtype": "uint8"}}, {"name": "batch_normalization_13/moving_mean", "shape": [16], "dtype": "float32", "quantization": {"min": -4.176761713214949, "scale": 0.03940341238882027, "dtype": "uint8"}}, {"name": "batch_normalization_13/moving_variance", "shape": [16], "dtype": "float32", "quantization": {"min": 2.6217024326324463, "scale": 0.028943236668904623, "dtype": "uint8"}}, {"name": "batch_normalization_14/gamma", "shape": [16], "dtype": "float32", "quantization": {"min": 0.8585795164108276, "scale": 0.0014400435428993375, "dtype": "uint8"}}, {"name": "batch_normalization_14/beta", "shape": [16], "dtype": "float32", "quantization": {"min": -0.4252553571673001, "scale": 0.002443996305559196, "dtype": "uint8"}}, {"name": "batch_normalization_14/moving_mean", "shape": [16], "dtype": "float32", "quantization": {"min": -3.160310737291972, "scale": 0.016900057418673647, "dtype": "uint8"}}, {"name": "batch_normalization_14/moving_variance", "shape": [16], "dtype": "float32", "quantization": {"min": 2.241117238998413, "scale": 0.013521801256665996, "dtype": "uint8"}}, {"name": "batch_normalization_15/gamma", "shape": [16], "dtype": "float32", "quantization": {"min": 0.8783265948295593, "scale": 0.0025047561701606303, "dtype": "uint8"}}, {"name": "batch_normalization_15/beta", "shape": [16], "dtype": "float32", "quantization": {"min": -0.461445166199815, "scale": 0.0031823804565504483, "dtype": "uint8"}}, {"name": "batch_normalization_15/moving_mean", "shape": [16], "dtype": "float32", "quantization": {"min": -1.5030063904967963, "scale": 0.013069620786928663, "dtype": "uint8"}}, {"name": "batch_normalization_15/moving_variance", "shape": [16], "dtype": "float32", "quantization": {"min": 1.6185407638549805, "scale": 0.006461739072612688, "dtype": "uint8"}}, {"name": "batch_normalization_16/gamma", "shape": [32], "dtype": "float32", "quantization": {"min": 1.262418270111084, "scale": 0.004027163748647653, "dtype": "uint8"}}, {"name": "batch_normalization_16/beta", "shape": [32], "dtype": "float32", "quantization": {"min": -0.4907525459925334, "scale": 0.0029923935731252034, "dtype": "uint8"}}, {"name": "batch_normalization_16/moving_mean", "shape": [32], "dtype": "float32", "quantization": {"min": -9.9686378030216, "scale": 0.051919988557404165, "dtype": "uint8"}}, {"name": "batch_normalization_16/moving_variance", "shape": [32], "dtype": "float32", "quantization": {"min": 5.755209922790527, "scale": 0.025763792150160846, "dtype": "uint8"}}, {"name": "batch_normalization_9/gamma", "shape": [4], "dtype": "float32", "quantization": {"min": 1.024720311164856, "scale": 0.0001804679047827627, "dtype": "uint8"}}, {"name": "batch_normalization_9/beta", "shape": [4], "dtype": "float32", "quantization": {"min": -0.10381092288914848, "scale": 0.0011664148639230166, "dtype": "uint8"}}, {"name": "batch_normalization_9/moving_mean", "shape": [4], "dtype": "float32", "quantization": {"min": -0.9381846995914683, "scale": 0.005975698723512537, "dtype": "uint8"}}, {"name": "batch_normalization_9/moving_variance", "shape": [4], "dtype": "float32", "quantization": {"min": 0.10991385579109192, "scale": 0.0012588589799170402, "dtype": "uint8"}}, {"name": "conv2d_10/kernel", "shape": [3, 3, 3, 4], "dtype": "float32", "quantization": {"min": -0.5564213079564712, "scale": 0.004215312939064175, "dtype": "uint8"}}, {"name": "conv2d_10/bias", "shape": [4], "dtype": "float32", "quantization": {"min": -0.030010943202411426, "scale": 0.0003572731333620408, "dtype": "uint8"}}, {"name": "conv2d_11/kernel", "shape": [3, 3, 4, 8], "dtype": "float32", "quantization": {"min": -0.6679184191367206, "scale": 0.004947543845457189, "dtype": "uint8"}}, {"name": "conv2d_11/bias", "shape": [8], "dtype": "float32", "quantization": {"min": -0.004185034290832632, "scale": 6.97505715138772e-05, "dtype": "uint8"}}, {"name": "conv2d_12/kernel", "shape": [3, 3, 8, 8], "dtype": "float32", "quantization": {"min": -0.6976386145049451, "scale": 0.004983132960749608, "dtype": "uint8"}}, {"name": "conv2d_12/bias", "shape": [8], "dtype": "float32", "quantization": {"min": -0.0016894739029892519, "scale": 2.7249579080471806e-05, "dtype": "uint8"}}, {"name": "conv2d_13/kernel", "shape": [3, 3, 8, 8], "dtype": "float32", "quantization": {"min": -0.6386413001546674, "scale": 0.005109130401237338, "dtype": "uint8"}}, {"name": "conv2d_13/bias", "shape": [8], "dtype": "float32", "quantization": {"min": -0.0031905139851219518, "scale": 1.733974991914104e-05, "dtype": "uint8"}}, {"name": "conv2d_14/kernel", "shape": [3, 3, 8, 16], "dtype": "float32", "quantization": {"min": -0.7860671665154251, "scale": 0.006000512721491795, "dtype": "uint8"}}, {"name": "conv2d_14/bias", "shape": [16], "dtype": "float32", "quantization": {"min": -0.0011771902606329497, "scale": 8.530364207485142e-06, "dtype": "uint8"}}, {"name": "conv2d_15/kernel", "shape": [3, 3, 16, 16], "dtype": "float32", "quantization": {"min": -0.7820679907705269, "scale": 0.0061099061778947415, "dtype": "uint8"}}, {"name": "conv2d_15/bias", "shape": [16], "dtype": "float32", "quantization": {"min": -0.0006838097116069905, "scale": 6.051413377053013e-06, "dtype": "uint8"}}, {"name": "conv2d_16/kernel", "shape": [3, 3, 16, 16], "dtype": "float32", "quantization": {"min": -0.696761716113371, "scale": 0.005318791726056267, "dtype": "uint8"}}, {"name": "conv2d_16/bias", "shape": [16], "dtype": "float32", "quantization": {"min": -0.000848032280063147, "scale": 7.2481391458388634e-06, "dtype": "uint8"}}, {"name": "conv2d_17/kernel", "shape": [3, 3, 16, 32], "dtype": "float32", "quantization": {"min": -0.8614595473981371, "scale": 0.006288025893417059, "dtype": "uint8"}}, {"name": "conv2d_17/bias", "shape": [32], "dtype": "float32", "quantization": {"min": -0.00028094356541759244, "scale": 3.4261410416779565e-06, "dtype": "uint8"}}, {"name": "conv2d_18/kernel", "shape": [3, 3, 32, 1], "dtype": "float32", "quantization": {"min": -1.075140060630499, "scale": 0.007215705104902679, "dtype": "uint8"}}, {"name": "conv2d_18/bias", "shape": [1], "dtype": "float32", "quantization": {"min": 0.12225606292486191, "scale": 1.0, "dtype": "uint8"}}]}]}